Repository: zipf/perldoc-es
Catalog: memory/clean/omegat_clean_prj-level2.tmx
Source language: en_us
Languages: es

source: You are permitted and encouraged to use this code and any derivatives thereof in your own programs for fun or for profit as you see fit.
es: Le permitimos y animamos a utilizar este código y los derivados que surjan en sus propios programas, ya sea con fines de diversión o beneficio.

source: You can change the file's name or even move a file around from directory to directory within a filesystem without actually moving the file itself, at least under Unix.
es: Puede cambiar el nombre de un archivo o incluso moverlo de un directorio a otro en el sistema de archivos sin mover realmente el archivo (al menos en Unix).

source: You can reach the sysadmins in #p5p on irc.perl.org or via mail to C<perl5-porters@perl.org>.
es: Puede ponerse en contacto con los administradores del sistema en el canal #p5p de irc.perl.org o enviar un mensaje de correo electrónico a C<perl5-porters@perl.org>.

source: You can switch into a package in more than one place; it merely influences which symbol table is used by the compiler for the rest of that block.
es: Puede cambiar a un paquete en más de un lugar; esto solo influye en la tabla de símbolos que el compilador usará para el resto del bloque.

source: You can use the defined() operator to determine whether a scalar value is defined (this has no meaning on arrays or hashes), and the undef() operator to produce an undefined value.
es: Se puede usar el operador defined() para determinar si un valor escalar está definido (no tiene sentido aplicar esto a arrays o hashes), y el operador undef() para producir un valor no definido.

source: You can L<tie|perlfunc/tie> your hash variables to various DBM implementations--see L<AnyDBM_File> and L<DB_File>.
es: Puede L<atar|perlfunc/tie> las variables de hash a varias implementaciones de DBM (vea L<AnyDBM_File> y L<DB_File>).

source: You can actually put an array or hash anywhere in the list, but the first one in the list will soak up all the values, and anything after it will become undefined.
es: En realidad, se puede colocar un array o un hash en cualquier lugar de la lista, pero el primero que figure en la lista absorberá todos los valores, y lo que venga después quedará indefinido.

source: You can add new paths to the default C<@INC> in the Preferences menu item in the MacPerl application (C<$ENV{MACPERL}site_lib:> is added automagically).
es: Puede agregar nuevas rutas a los valores predeterminados de C<@INC> a través del elemento de menú Preferencias de la aplicación MacPerl (C<$ENV{MACPERL}site_lib:> se agrega automágicamente).

source: You can also choose to override some of these methods in your class.
es: También puede sobrescribir algunos de estos métodos en sus clases.

source: You can also check the value of C<$AUTOLOAD> and return without doing anything when called to handle C<DESTROY>.
es: También puede comprobar el valor de C<$AUTOLOAD> y volver sin hacer nada cuando se realice la llamada para controlar C<DESTROY>.

source: You can also cherry-pick commits from blead and another branch, by using the C<git cherry-pick> command.
es: También puede seleccionar confirmaciones de blead y de otra rama mediante el comando C<git cherry-pick>.

source: You can also configure C<sendemail.smtppass> with your password if you don't care about having your password in the .gitconfig file.
es: También puede configurar C<sendemail.smtppass> con su contraseña si no le importa almacenarla en el archivo .gitconfig.

source: You can also embed newlines directly in your strings, i.e., they can end on a different line than they begin.
es: También puede incrustar directamente caracteres de nueva línea en las cadenas; es decir, las cadenas pueden terminar en una línea distinta.

source: You can also extend an array by assigning to an element that is off the end of the array.
es: Otra forma de ampliar un array es hacer una asignación a un elemento que esté más allá del final del array.

source: You can also gain some minuscule measure of efficiency by pre-extending an array that is going to get big.
es: También se puede obtener un pequeño aumento de eficiencia ampliando previamente un array que va a crecer.

source: You can also go the other direction, and write your main program in C or C++, and then link in some Perl code on the fly, to create a powerful application.
es: También puede optar por trabajar en sentido contrario: desarrollar el programa principal en C o C++, y después vincular código Perl sobre la marcha para crear una aplicación eficaz.

source: You can also override C<DOES> directly in your own classes.
es: También puede sobrescribir C<DOES> directamente en sus clases.

source: You can also put directly the path to your perl executable, like in C<#!/usr/bin/perl>).
es: También puede especificar directamente la ruta de acceso a su ejecutable perl: C<#!/usr/bin/perl>).

source: You can also refer to capture groups relatively, by using a negative number, so that C and C<\g{-1}> both refer to the immediately preceding capture group, and C and C<\g{-2}> both refer to the group before it.
es: También puede hacer referencia a los grupos de captura de forma relativa, con un número negativo, por lo que C y C<\g{-1}> hacen referencia al grupo de captura inmediatamente anterior, y C y C<\g{-2}> hacen referencia al grupo anterior a este.

source: You can also set up your user name and e-mail address.
es: También puede configurar su nombre de usuario y su dirección de correo electrónico.

source: You can also subscript a list to get a single element from it:
es: También puede subindexar una lista para obtener un solo elemento de ella.

source: You can also use C<pos()> to know what is the current position of matching within this string.
es: También puede usar C<pos()> para determinar la posición actual de coincidencia dentro de esa cadena.

source: You can also use C<while> in a post-condition:
es: También puede usar C<while> en una condición posterior:

source: You can also use a subroutine reference as a method:
es: También es posible usar una referencia a una subrutina como un método:

source: You can avoid the ambiguity by always using C<\g{}> or C<\g> if you mean capturing groups; and for octal constants always using C<\o{}>, or for C and below, using 3 digits padded with leading zeros, since a leading zero implies an octal constant.
es: Puede evitar la ambigüedad usando siempre C<\g{}> o C<\g> si se refiere a grupos de captura, y C<\o{}> para las constantes octales; o bien, para C e inferiores, usando 3 dígitos con ceros de relleno a la izquierda, ya que un cero a la izquierda implica una constante octal.

source: You can cause characters that normally function as metacharacters to be interpreted literally by prefixing them with a "\" (e.g., "\." matches a ".", not any character; "\\" matches a "\").
es: Puede hacer que los caracteres que normalmente funcionan como metacaracteres se interpreten literalmente mediante el prefijo "\" (p.ej., "\." detecta un "." literal, no cualquier carácter; "\\" detecta una barra diagonal inversa, "\").

source: You can define a subroutine outside its package by explicitly qualifying the name of the subroutine:
es: Es posible definir una subrutina fuera del paquete calificando explícitamente el nombre de la subrutina:

source: You can dispense with numbers altogether and create named capture groups.
es: Puede prescindir de los números y crear grupos de captura con nombres.

source: You can do this via the following formula (see the explanation about C<refspec>'s in the git push documentation for details) after you have rebased your branch:
es: Puede hacer esto con la fórmula siguiente (para obtener más información, vea la descripción de C<refspec> en la documentación sobre git push) tras reorganizar la rama:

source: You can do various useful things to lists:
es: Puede hacer varias cosas útiles con las listas:

source: You can examine your last commit with:
es: Puede examinar su última confirmación con el siguiente comando:

source: You can force Perl to interpret the bareword as a class name by appending "::" to it, like we saw earlier:
es: Puede obligar a Perl a interpretar las palabras sueltas como nombres de clase agregándoles "::", como se vio previamente.

source: You can force Perl to use the first interpretation (i.e. as a method call on the class named "Class") in two ways.
es: Puede forzar a Perl a usar la primera interpretación (es decir, como una llamada a un método de la clase llamada "Clase") de dos formas.

source: You can force UTF-8 encoding on in a string
es: Puede forzar la aplicación de una codificación UTF-8 en una cadena

source: You can get an overview of all the files with this command:
es: Puede ver una descripción general de todos los archivos con el siguiente comando:

source: You can get at lists of keys and values with C<keys()> and C<values()>.
es: Puede obtener una lista de las claves y los valores con C<keys()> y C<values()> respectivamente.

source: You can get commercial support of Perl if you wish, although for most users the informal support will more than suffice.
es: Si lo desea, puede obtener soporte comercial para Perl, pero a la mayoría de los usuarios les bastará con el soporte informal.

source: You can get gzip from http://www.s390.ibm.com/products/oe/bpxqp1.html
es: Puede obtener gzip en http://www.s390.ibm.com/products/oe/bpxqp1.html

source: You can get gzip from ftp://prep.ai.mit.edu/pub/gnu/
es: Puede obtener gzip desde ftp://prep.ai.mit.edu/pub/gnu/

source: You can get more documentation, tutorials and community support online at L<http://www.perl.org/>.
es: Puede obtener más documentación, tutoriales y soporte de la comunidad en línea en L<http://www.perl.org/>.

source: You can make a read-only clone of the repository by running:
es: Puede crear un clon de solo lectura de este repositorio. Para ello, ejecute:

source: You can modify C<$?> to change the exit value of the program.
es: Puede modificar C<$?> para cambiar el valor de salida del programa.

source: You can omit the C<"g">, and write C<"\1">, etc, but there are some issues with this form, described below.
es: Puede omitir la C<"g">, y escribir C<"\1">, etc., pero esta forma presenta algunos problemas, como se explica más abajo.

source: You can open a file for input or output using the C<open()> function.
es: La función C<open()> abre un archivo para entrada o salida.

source: You can peek into the bisecting process with C<git bisect log> and C<git bisect visualize>.
es: Si desea analizar el proceso de bisección, puede usar C<git bisect log> y C<git bisect visualize>.

source: You can preallocate space for a hash by assigning to the keys() function.
es: Puede reservar espacio para un hash mediante una asignación a la función keys().

source: You can prevent this by defining an empty C<DESTROY>, like we did in the autoloading example.
es: Puede evitar este comportamiento definiendo un método C<DESTROY> vacío, como hicimos en el ejemplo de carga automática.

source: You can provide this layer when C<open>ing the file:
es: Puede aplicar esta capa al abrir el archivo con C<open>:

source: You can read from an open filehandle using the C<< <> >> operator.
es: Puede utilizar el operador C<< <> >> para leer de un identificador de archivo abierto.

source: You can read that documentation using the C<perldoc> command or whatever method you're using to read this document.
es: Puede consultar la documentación mediante el comando C<perldoc> o cualquier otro método que use para leer este documento.

source: You can refer to them by absolute number (using C<"$1"> instead of C<"\g1">, etc); or by name via the C<%+> hash, using C<"$+{I<name>}">.
es: Puede hacer referencia a un grupo de captura mediante un número absoluto (usando C<"$1"> en lugar de C<"\g1">, etc.), o mediante un nombre a través del hash C<%+>, usando C<"$+{I<nombre>}">.

source: You can refer to variables and filehandles in other packages by prefixing the identifier with the package name and a double colon: C<$Package::Variable>.
es: Puede hacer referencia a variables e identificadores de archivo en otros paquetes usando como prefijo del identificador el nombre del paquete y un doble signo de dos puntos: C<$Paquete::Variable>.

source: You can remove this mis-merge locally by adding the following line to your C<.git/info/grafts> file:
es: Pero puede eliminar localmente esta combinación incorrecta agregando la línea siguiente a su archivo C<.git/info/grafts>:

source: You can say C<*foo{PACKAGE}> and C<*foo{NAME}> to find out what name and package the *foo symbol table entry comes from.
es: Puede usar C<*foo{PACKAGE}> y C<*foo{NAME}> para averiguar de qué nombre y paquete proviene la entrada *foo de la tabla de símbolos.

source: You can search CPAN on L<http://metacpan.org> or L<http://search.cpan.org/>.
es: Puede hacer búsquedas en CPAN a través de L<http://metacpan.org> o L<http://search.cpan.org/>.

source: You can see recent commits:
es: Para ver las confirmaciones recientes:

source: You can see what files are changed:
es: Puede ver qué archivos han cambiado:

source: You can specify a character class, by enclosing a list of characters in C<[]>, which will match any character from the list.
es: Para especificar una clase de caracteres, se escribe la lista de caracteres entre corchetes (C<[]>). La clase de caracteres permite detectar cualquier carácter de la lista.

source: You can specify a series of alternatives for a pattern using "|" to separate them, so that C<fee|fie|foe> will match any of "fee", "fie", or "foe" in the target string (as would C<f(e|i|o)e>).
es: Puede especificar una serie de alternativas para un patrón separándolas con "|", por lo que C<fee|fie|foe> detectará cualquier instancia de "fee", "fie" o "foe" en la cadena de búsqueda (al igual que C<f(e|i|o)e>).

source: You can specify several classes to try by joining them with commas or semicolons, as in C<-MTk::SuperPod;Tk::Pod>.
es: Puede especificar varias clases separándolas con comas o signos de punto y coma (por ejemplo, C<-MTk::SuperPod;Tk::Pod>).

source: You can submit bugs to RT either through its web interface or by email.
es: Puede enviar informes de error a RT a través de su interfaz web o por correo electrónico.

source: You can then run the bisecting process with:
es: Después se ejecuta el proceso de bisección con:

source: You can think of a method as the things that an object can I<do>.
es: Se puede considerar que los métodos de un objeto son las operaciones que un objeto puede I<hacer>.

source: You can think of a module as the fundamental unit of reusable Perl code; see L<perlmod> for details.
es: Un módulo se puede definir como la unidad fundamental de código Perl reutilizable; encontrará más información en L<perlmod>.

source: You can treat a pseudohash reference as either an array reference or a hash reference.
es: Puede tratar una referencia de seudohash como una referencia de array o una referencia de hash.

source: You can try to provoke a fatal error with the L<die|perlfunc/die> operator (known as throwing or raising an exception), but this may be caught by a dynamically enclosing L<eval|perlfunc/eval>.
es: Puede intentar provocar un error irrecuperable con el operador L<die|perlfunc/die> (lo que se conoce como desencadenar o provocar una excepción), pero esto puede ser capturado mediante un operador L<eval|perlfunc/eval> aplicado dinámicamente.

source: You can use
es: Puede usar

source: You can use Andreas Koenig's CPAN module ( http://www.cpan.org/modules/by-module/CPAN ) to automate the following steps, from DECOMPRESS through INSTALL.
es: Puede usar el módulo CPAN de Andreas Koenig ( http://www.cpan.org/modules/by-module/CPAN ) para automatizar los siguientes pasos, desde la descompresión hasta la instalación.

source: You can use C<-w optionname> (without a value) as shorthand for C<-w optionname:I<TRUE>>.
es: Puede usar C<-w nombre_opción> (sin un valor) como una forma abreviada de C<-w nombre_opción:I<TRUE>>.

source: You can use Unicode in string literals, in identifiers (but they still have to be "word characters" according to C<\w>), and even in custom delimiters.
es: Puede usar Unicode en literales de cadena, en identificadores (aunque deben ser "caracteres de palabra" compatibles con C<\w>) e incluso en delimitadores personalizados.

source: You can use a leading underscore to indicate that a variable or function should not be used outside the package that defined it.
es: Puede agregar un guión bajo inicial al principio del nombre de una variable o función para indicar no se debe usar fuera del paquete en el que se definió.

source: You can use an "=" instead of the ":", as in: C<-w textsize=15>.
es: Puede usar un signo "=" en lugar del signo ":"; por ejemplo, C<-w textsize=15>.

source: You can use and redistribute this document under the same terms as Perl itself.
es: Puede usar y redistribuir este documento en los mismos términos que Perl.

source: You can use any combination of the methods from none to all four.
es: Puede usar cualquier combinación de estos métodos (desde ninguno hasta los cuatro).

source: You can use parentheses for functions' arguments or omit them according to your personal taste.
es: Puede escribir los argumentos de las funciones entre paréntesis u omitir los paréntesis, si lo prefiere.

source: You can use the C<${^GLOBAL_PHASE}> variable to detect if you are currently in the global destruction phase:
es: Puede usar la variable C<${^GLOBAL_PHASE}> para comprobar si está actualmente en la fase de destrucción global:

source: You can use the shareware Winzip ( http://www.winzip.com ) to decompress and unpack modules.
es: Puede usar el software shareware WinZip (http://www.winzip.com) para descomprimir y desempaquetar el módulo.

source: You can use this stream explicitly, but the L<die|perlfunc/die> and L<warn|perlfunc/warn> built-ins write to your standard error stream automatically.
es: Puede usar esta secuencia explícitamente, pero las funciones predefinidas L<die|perlfunc/die> y L<warn|perlfunc/warn> escriben en la secuencia de error estándar automáticamente.

source: You can use this to break up your regular expression into (slightly) more readable parts.
es: Puede usar esto para descomponer la expresión regular en partes (un poco) más legibles.

source: You can use this to print out all the variables in a package, for instance.
es: Puede usar esto para imprimir todas las variables del paquete, por ejemplo.

source: You can use whitespace and the C<< => >> operator to lay them out more nicely:
es: Puede usar espacio en blanco y el operador C<< => >> para expresarlos de manera más clara:

source: You can work around the first case by using the fully qualified name (C<$Package::FOO>) where you need a local value, or by overriding it by saying C<*FOO = *Package::FOO> in your script.
es: Puede evitar el primer caso usando el nombre completo (C<$Package::FOO>) donde necesite un valor local, o bien reemplazarlo mediante C<*FOO = *Package::FOO> en el script.

source: You can't have a filehandle named "log", for instance.
es: Por ejemplo, no se puede usar un identificador de archivo llamado "log".

source: You can't use it for regular subroutine calls or class methods:
es: No se puede usar para llamadas normales a subrutinas ni para métodos de clase:

source: You can't disambiguate that by saying C<\{1}000>, whereas you can fix it with C<${1}000>.
es: No puede eliminar la ambigüedad con C<\{1}000>, pero lo puede arreglar con C<${1}000>.

source: You can't.
es: No se puede.

source: You cannot use this for look-behind.
es: No puede usar esto en las inspecciones hacia atrás.

source: You certainly won't be chastised if you don't trust nuclear-plant or brain-surgery monitoring code to it.
es: Nadie le reprochará que no lo utilice para desarrollar código de control de centrales nucleares o neurocirugía.

source: You could consider adopting a kind of "Hungarian notation" to help with this.
es: Podría usar una notación "húngara" como ayuda.

source: You could open the document in a web browser, and change the character set or character encoding until you can visually confirm that all characters look the way they should.
es: Puede abrir el documento en un navegador web y probar varios juegos o codificaciones de caracteres hasta confirmar visualmente que se ven bien todos los caracteres.

source: You could, for example, group binary digits by threes (as for a Unix-style mode argument such as 0b110_100_100) or by fours (to represent nibbles, as in 0b1010_0110) or in other groups.
es: Por ejemplo, puede agrupar los dígitos binarios en grupos de tres (como para un argumento de modo estilo Unix, p. ej., 0b110_100_100) o de cuatro (para representar nibbles, como en 0b1010_0110), o bien en grupos de otros tamaños.

source: You do this by using L<Carp|Carp> and replacing your C<warn>s with C<carp>s.
es: Para ello debe usar L<Carp|Carp> y reemplazar C<warn> por C<carp>.

source: You don't have to worry about finding or paying for Perl; it's freely available and several popular operating systems come with Perl.
es: No tiene que preocuparse de buscar o pagar por usar Perl; está disponible gratuitamente y varios sistemas operativos populares lo incluyen.

source: You don't just have to match on fixed strings.
es: No tiene que limitarse a detectar coincidencias en cadenas fijas.

source: You first enter in bisect mode with:
es: Primero debe entrar en modo de bisección con:

source: You gave me bar::baz
es: Recibí bar::baz

source: You gave me main::foo
es: Recibí main::foo

source: You have to make "/hurd/pfinet" the translator for "/servers/socket/2", giving it the right arguments.
es: Debe establecer "/hurd/pfinet" como traductor de "/servers/socket/2", suministrándole los argumentos correctos.

source: You have a DBM database that you need to share with a third-party C application.
es: Tiene una base de datos DBM que desea compartir con una aplicación en C de terceros.

source: You have a piece of data on which many different operations are applied.
es: Tiene datos a los que hay que aplicar muchas operaciones diferentes.

source: You have to increment it eight times to shampoo your hair.
es: Debe incrementar ocho veces para lavar el pelo.

source: You may also give a descriptive name of a page, such as C<perlfunc>.
es: También puede especificar un nombre descriptivo de una página, como C<perlfunc>.

source: You may find it helpful to use letter case to indicate the scope or nature of a variable.
es: Puede encontrar útil usar el tamaño de caja de las letras para indicar el ámbito o la naturaleza de una variable.

source: You may find the length of array @days by evaluating C<$#days>, as in B<csh>.
es: Para conocer la longitud del array @jornadas, puede evaluar C<$#jornadas>, como en B<csh>.

source: You may have an optional comma before the closing parenthesis of a list literal, so that you can say:
es: Opcionalmente, puede agregar una coma antes del paréntesis de cierre en una lista literal, de modo que puede escribir:

source: You may have multiple C<BEGIN> blocks within a file (or eval'ed string); they will execute in order of definition.
es: Es posible disponer de varios bloques C<BEGIN> en el mismo archivo (o cadena evaluada); se ejecutarán por orden de definición.

source: You may have multiple C<END> blocks within a file--they will execute in reverse order of definition; that is: last in, first out (LIFO).
es: Puede disponer de múltiples bloques C<END> en un mismo archivo; se ejecutarán en orden inverso al de la definición: es decir, siguiendo el orden "primero en llegar, último en salir" (LIFO, I<last in, first out>).

source: You may have to re-read this entire section a few times...
es: Es posible que tenga que leer esta sección varias veces...
